# Agenda: Real-world

1. Recap and Q&A
2. More about CSV
3. Sorting with data
4. Grouping
5. Pivot tables
6. Joining
7. Cleaning

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
df = DataFrame([[10, 20, 30, 40],
                [50, 60, 70, 80]],
               index=list('ab'),
               columns=list('wxyz'))

In [5]:
df

    w   x   y   z
a  10  20  30  40
b  50  60  70  80

In [9]:
# retrieve an entire row, use .loc

df.loc['b']     # this retrieves a row

w    50
x    60
y    70
z    80
Name: b, dtype: int64

In [10]:
df['x']    # this retrieves a column

a    20
b    60
Name: x, dtype: int64

In [11]:
df['y']   # so does this

a    30
b    70
Name: y, dtype: int64

In [12]:
# row selectors and column selectors with .loc

df.loc['b', 'y']  # row b and column y

70

In [13]:
# I want all of the elements from row b, columns x and y

df.loc['b', ['x', 'y']]

x    60
y    70
Name: b, dtype: int64

In [14]:
df

    w   x   y   z
a  10  20  30  40
b  50  60  70  80

In [15]:
df['w'] > 30

a    False
b     True
Name: w, dtype: bool

In [17]:
# wherever w is greater than 30,
# we want to see columns x and z

df.loc[
    df['w'] > 30,   # row selector -- a boolean series, which will act as a mask index
    ['x', 'z']       
    ]

    x   z
b  60  80

In [19]:
df = pd.read_csv('taxi.csv')
df.head()   # shows us the first five rows

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [21]:
df = pd.read_csv('taxi.csv', usecols=['passenger_count', 'trip_distance', 'total_amount'])
df.head()   # shows us the first five rows

   passenger_count  trip_distance  total_amount
0                1           1.63         17.80
1                1           0.46          8.30
2                1           0.87         11.00
3                1           2.13         17.16
4                1           1.40         10.30

In [23]:
# show me how much, on average, people paid and how far they traveled when the number of passengers was
# greater than 2

df.loc[
    df['passenger_count'] > 2,  # row selector 
    ['trip_distance', 'total_amount']  # column selector
].mean()

trip_distance     3.278653
total_amount     17.679939
dtype: float64

In [26]:
df = pd.read_csv('taxi.csv', header=None,
                usecols=[3, 4])  # the first row is *not* considered to be the headers (column names)

In [27]:
df.head()

                 3              4
0  passenger_count  trip_distance
1                1           1.63
2                1            .46
3                1            .87
4                1           2.13

In [29]:
df = pd.read_csv('taxi.csv', header=None,
                usecols=[3, 4],
                names=['count', 'distance'])  # the first row is *not* considered to be the headers (column names)

In [30]:
df

                count       distance
0     passenger_count  trip_distance
1                   1           1.63
2                   1            .46
3                   1            .87
4                   1           2.13
...               ...            ...
9995                1           2.70
9996                1           4.50
9997                1           5.59
9998                6           1.54
9999                1           5.80

[10000 rows x 2 columns]

In [31]:
# get all values in df other than those in row 0
df = df[1:]

In [32]:
df

     count distance
1        1     1.63
2        1      .46
3        1      .87
4        1     2.13
5        1     1.40
...    ...      ...
9995     1     2.70
9996     1     4.50
9997     1     5.59
9998     6     1.54
9999     1     5.80

[9999 rows x 2 columns]

In [33]:
# what happens if I now ask for the mean values of these two columns?
df.mean()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_7275/2498805070.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

count    inf
dtype: float64

In [34]:
df.dtypes  # what dtypes do we have in these two columns

count       object
distance    object
dtype: object

In [36]:
df['count'] = df.loc['count'].astype(np.int64)
df['distance'] = df.loc['distance'].astype(np.float64)

KeyError: 'count'

In [37]:
df.head()

   count  distance
1      1      1.63
2      1      0.46
3      1      0.87
4      1      2.13
5      1      1.40

In [38]:
df.dtypes

count         int64
distance    float64
dtype: object

In [39]:
df = pd.read_csv('AAPL.csv')

In [40]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
1,2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2,2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
3,2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
4,2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300

In [41]:
df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [43]:
# set the index of the data frame to be the Date column from the input CSV
df = pd.read_csv('AAPL.csv', index_col='Date')

In [44]:
df

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300
2018-04-16,175.029999,176.190002,174.830002,175.820007,175.820007,21578400
2018-04-17,176.490005,178.940002,176.410004,178.240005,178.240005,26605400
2018-04-18,177.809998,178.820007,176.880005,177.839996,177.839996,20754500
2018-04-19,173.759995,175.389999,172.660004,172.800003,172.800003,34808800
2018-04-20,170.600006,171.220001,165.429993,165.720001,165.720001,65491100
2018-04-23,166.830002,166.919998,164.089996,165.240005,165.240005,36515500
2018-04-24,165.669998,166.330002,161.220001,162.940002,162.940002,33692000
2018-04-25,162.619995,165.419998,162.410004,163.649994,163.649994,28382100
2018-04-26,164.119995,165.729996,163.369995,164.220001,164.220001,27963000
2018-04-27,164.000000,164.330002,160.630005,162.320007,162.320007,35655800
2018-04-30,162.130005,167.259995,161.839996,165.259995,165.259995,42427400
2018-05-01,166.410004,169.199997,165.270004,169.100006,169.100006,53569400
2018-05-02,175.229996,177.750000,173.800003,176.570007,176.570007,66539400
2018-05-03,175.880005,177.500000,174.440002,176.889999,176.889999,34068200
2018-05-04,178.250000,184.250000,178.169998,183.830002,183.830002,56201300
2018-05-07,185.179993,187.669998,184.750000,185.160004,185.160004,42451400
2018-05-08,184.990005,186.220001,183.669998,186.050003,186.050003,28030400

In [45]:
df.loc['2018-05-07']

Open         1.851800e+02
High         1.876700e+02
Low          1.847500e+02
Close        1.851600e+02
Adj Close    1.851600e+02
Volume       4.245140e+07
Name: 2018-05-07, dtype: float64

In [46]:
# I can give read_csv  a URL!

pd.read_csv('https://gist.githubusercontent.com/reuven/361d2c2b12dab426f4ed4efb396c89e5/raw/744dc0e9b193b53e3f76712cdfa32fa443440594/AAPL.csv')

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
1,2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2,2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
3,2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
4,2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300
5,2018-04-16,175.029999,176.190002,174.830002,175.820007,175.820007,21578400
6,2018-04-17,176.490005,178.940002,176.410004,178.240005,178.240005,26605400
7,2018-04-18,177.809998,178.820007,176.880005,177.839996,177.839996,20754500
8,2018-04-19,173.759995,175.389999,172.660004,172.800003,172.800003,34808800
9,2018-04-20,170.600006,171.220001,165.429993,165.720001,165.720001,65491100
10,2018-04-23,166.830002,166.919998,164.089996,165.240005,165.240005,36515500
11,2018-04-24,165.669998,166.330002,161.220001,162.940002,162.940002,33692000
12,2018-04-25,162.619995,165.419998,162.410004,163.649994,163.649994,28382100
13,2018-04-26,164.119995,165.729996,163.369995,164.220001,164.220001,27963000
14,2018-04-27,164.000000,164.330002,160.630005,162.320007,162.320007,35655800
15,2018-04-30,162.130005,167.259995,161.839996,165.259995,165.259995,42427400
16,2018-05-01,166.410004,169.199997,165.270004,169.100006,169.100006,53569400
17,2018-05-02,175.229996,177.750000,173.800003,176.570007,176.570007,66539400
18,2018-05-03,175.880005,177.500000,174.440002,176.889999,176.889999,34068200
19,2018-05-04,178.250000,184.250000,178.169998,183.830002,183.830002,56201300
20,2018-05-07,185.179993,187.669998,184.750000,185.160004,185.160004,42451400
21,2018-05-08,184.990005,186.220001,183.669998,186.050003,186.050003,28030400

In [47]:
#  we can choose columns, using usecols

pd.read_csv('https://gist.githubusercontent.com/reuven/361d2c2b12dab426f4ed4efb396c89e5/raw/744dc0e9b193b53e3f76712cdfa32fa443440594/AAPL.csv',
           usecols=['Open', 'Close'])

          Open       Close
0   169.880005  170.050003
1   173.000000  173.250000
2   172.229996  172.440002
3   173.410004  174.139999
4   174.779999  174.729996
5   175.029999  175.820007
6   176.490005  178.240005
7   177.809998  177.839996
8   173.759995  172.800003
9   170.600006  165.720001
10  166.830002  165.240005
11  165.669998  162.940002
12  162.619995  163.649994
13  164.119995  164.220001
14  164.000000  162.320007
15  162.130005  165.259995
16  166.410004  169.100006
17  175.229996  176.570007
18  175.880005  176.889999
19  178.250000  183.830002
20  185.179993  185.160004
21  184.990005  186.050003

# Exercise: Cisco stock info (from 5 years ago)

- Gist: https://gist.github.com/reuven/bb116ba2034bb10bb7e4e2caa5d8a000
- URL of the gist's raw CSV, which you should use, is here: https://gist.githubusercontent.com/reuven/bb116ba2034bb10bb7e4e2caa5d8a000/raw/3660c4af808684dbf17af48b3d2f25b6a218535f/CSCO.csv

1. Use `read_csv` to retrieve the Cisco stock information from 5 years ago, and put it into a data frame.  We're only interested in the `Date`, `Open`, `Close`, and `Volume` columns.
2. Find the day on which the `Open` price was the highest.
3. Find the day on which the `Close` price was the lowest.
4. Find the `Date`, `Open`, and `Close` values on the day when the `Volume` was at its highest.

In [48]:
pd.read_csv('https://oreilly.com')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 8, saw 4

In [49]:
cisco_csv_url = 'https://gist.githubusercontent.com/reuven/bb116ba2034bb10bb7e4e2caa5d8a000/raw/3660c4af808684dbf17af48b3d2f25b6a218535f/CSCO.csv'

pd.read_csv(cisco_csv_url)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2017-12-22,38.520000,38.740002,38.470001,38.549999,38.264591,11441600
1,2017-12-26,38.549999,38.680000,38.360001,38.480000,38.195110,8186100
2,2017-12-27,38.540001,38.650002,38.450001,38.560001,38.274517,10543000
3,2017-12-28,38.730000,38.730000,38.450001,38.590000,38.304295,8807700
4,2017-12-29,38.410000,38.619999,38.299999,38.299999,38.016441,12583600
5,2018-01-02,38.669998,38.950001,38.430000,38.860001,38.572296,20135700
6,2018-01-03,38.720001,39.279999,38.529999,39.169998,38.879997,29536000
7,2018-01-04,39.049999,39.540001,38.930000,38.990002,38.990002,20731400
8,2018-01-05,39.549999,39.880001,39.369999,39.529999,39.529999,24588200
9,2018-01-08,39.520000,39.959999,39.349998,39.939999,39.939999,16582000
10,2018-01-09,39.790001,39.959999,39.540001,39.689999,39.689999,21449800
11,2018-01-10,39.650002,40.240002,39.630001,39.910000,39.910000,19473000
12,2018-01-11,40.139999,40.209999,39.750000,40.099998,40.099998,21685600
13,2018-01-12,40.220001,40.930000,40.049999,40.869999,40.869999,23770500
14,2018-01-16,40.900002,41.160000,40.320000,40.540001,40.540001,32845000
15,2018-01-17,40.840000,41.320000,40.709999,41.200001,41.200001,24427100
16,2018-01-18,41.240002,41.480000,41.029999,41.299999,41.299999,19610200
17,2018-01-19,41.279999,41.520000,41.099998,41.290001,41.290001,24207800
18,2018-01-22,41.200001,41.520000,41.020000,41.340000,41.340000,6792482

In [50]:
df.dtypes

Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [57]:
cisco_csv_url = 'https://gist.githubusercontent.com/reuven/bb116ba2034bb10bb7e4e2caa5d8a000/raw/3660c4af808684dbf17af48b3d2f25b6a218535f/CSCO.csv'

df = pd.read_csv(cisco_csv_url, 
            usecols=['Date', 'Open', 'Close', 'Volume'])
df

          Date       Open      Close    Volume
0   2017-12-22  38.520000  38.549999  11441600
1   2017-12-26  38.549999  38.480000   8186100
2   2017-12-27  38.540001  38.560001  10543000
3   2017-12-28  38.730000  38.590000   8807700
4   2017-12-29  38.410000  38.299999  12583600
5   2018-01-02  38.669998  38.860001  20135700
6   2018-01-03  38.720001  39.169998  29536000
7   2018-01-04  39.049999  38.990002  20731400
8   2018-01-05  39.549999  39.529999  24588200
9   2018-01-08  39.520000  39.939999  16582000
10  2018-01-09  39.790001  39.689999  21449800
11  2018-01-10  39.650002  39.910000  19473000
12  2018-01-11  40.139999  40.099998  21685600
13  2018-01-12  40.220001  40.869999  23770500
14  2018-01-16  40.900002  40.540001  32845000
15  2018-01-17  40.840000  41.200001  24427100
16  2018-01-18  41.240002  41.299999  19610200
17  2018-01-19  41.279999  41.290001  24207800
18  2018-01-22  41.200001  41.340000   6792482

In [58]:
# Find the day on which the open price was the highest

df.loc[
    # row selector: All days on which 'Open' was the same as df['Open'].max()
    df['Open'] == df['Open'].max(),

    # column selector is 'Date'
    'Date'
]

17    2018-01-19
Name: Date, dtype: object

In [59]:
# Find the day on which the closing price was the lowest

df.loc[
    # row selector: All days on which 'Close' was the same as df['Close'].min()
    df['Close'] == df['Close'].min(),

    # column selector is 'Date'
    'Date'
]

4    2017-12-29
Name: Date, dtype: object

In [60]:
# Find the Date, Open, and Close values on the day when the Volume was at its highest.

df.loc[
    
    df['Volume'] == df['Volume'].max(),   # row selector
    ['Date', 'Open', 'Close']

    
]

          Date       Open      Close
14  2018-01-16  40.900002  40.540001

# `read_html`

The method `pd.read_html` goes to a Web page, and finds all of the HTML tables that are on that page. Each one is downloaded as a separate data frame, into a list of data frames.  You can then retrieve the table that you want from that list, and perform analyses on it.

In [61]:
all_dfs = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)_per_capita')

In [62]:
len(all_dfs)

6

In [63]:
all_dfs[0]

,0,1,2
0,.mw-parser-output .legend{page-break-inside:av...,"$20,000 - $30,000 $10,000 - $20,000 $5,000 - $...","$1,000 - $2,500 $500 - $1,000 <$500 No data"

In [64]:
all_dfs[1]

             Country/Territory UN Region IMF[4][5]       United Nations[6]  \
             Country/Territory UN Region  Estimate  Year          Estimate
0                          NaN       NaN       NaN   NaN               NaN
1              Liechtenstein *    Europe         —     —            180227
2                     Monaco *    Europe         —     —            173696
3                 Luxembourg *    Europe    135046  2022            117182
4                    Bermuda *  Americas         —     —            123945
..                         ...       ...       ...   ...               ...
213  Central AfricanRepublic *    Africa       527  2022               481
214             Sierra Leone *    Africa       513  2022               475
215               Madagascar *    Africa       504  2022               470
216              South Sudan *    Africa       393  2022              1421
217                  Burundi *    Africa       272  2022               286

          World Bank[7]
     Year      Estimate  Year
0     NaN           NaN   NaN
1    2020        169049  2019
2    2020        173688  2020
3    2020        135683  2021
4    2020        110870  2021
..    ...           ...   ...
213  2020           477  2020
214  2020           485  2020
215  2020           496  2020
216  2020          1120  2015
217  2020           274  2020

[218 rows x 8 columns]

In [65]:
df = all_dfs[1]

In [69]:
df.dtypes

Country/Territory  Country/Territory    object
UN Region          UN Region            object
IMF[4][5]          Estimate             object
                   Year                 object
United Nations[6]  Estimate             object
                   Year                 object
World Bank[7]      Estimate             object
                   Year                 object
dtype: object

In [70]:
# let's reassign the index on df

df.columns = ['country', 'un region', 'IMF estimate', 'IMF year', 'UN estimate', 'UN year', 'WB estimate', 'WB year']

In [71]:
df

,country,un region,IMF estimate,IMF year,UN estimate,UN year,WB estimate,WB year
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Liechtenstein *,Europe,—,—,180227,2020,169049,2019
2,Monaco *,Europe,—,—,173696,2020,173688,2020
3,Luxembourg *,Europe,135046,2022,117182,2020,135683,2021
4,Bermuda *,Americas,—,—,123945,2020,110870,2021
...,...,...,...,...,...,...,...,...
213,Central AfricanRepublic *,Africa,527,2022,481,2020,477,2020
214,Sierra Leone *,Africa,513,2022,475,2020,485,2020
215,Madagascar *,Africa,504,2022,470,2020,496,2020
216,South Sudan *,Africa,393,2022,1421,2020,1120,2015
217,Burundi *,Africa,272,2022,286,2020,274,2020

In [72]:
# row selector: slice, until (not including) row 5
# column selector: 'country'
df.loc[:5, 'country']

0                NaN
1    Liechtenstein *
2           Monaco *
3       Luxembourg *
4          Bermuda *
5          Ireland *
Name: country, dtype: object

# Exercise: Gasoline prices

1. Create a data frame of gasoline prices around the world, based on the URL https://tradingeconomics.com/country-list/gasoline-prices.
2. In which countries is gasoline (USD/liter) more expensive than the US?
3. In which countries is gasoline (USD/liter) more than 1.5x as expensive as in the US?

In [73]:
# all_dfs == list of data frames we got back from pd.read_html
# read_html needs to get a URL as its argument
# the URL can be either a string literal (with quotes) or a variable containing that string literal

all_dfs = pd.read_html('https://tradingeconomics.com/country-list/gasoline-prices')

In [74]:
len(all_dfs)

1

In [75]:
# get the data frame, and assign it to df
df = all_dfs[0]

In [76]:
df.head()

        Country  Last  Previous Reference       Unit
0     Indonesia  0.51      0.52    Jun/22  USD/Liter
1  Saudi Arabia  0.62      0.62    Jul/22  USD/Liter
2        Russia  0.86      0.96    Jul/22  USD/Liter
3     Argentina  0.91      0.95    Jul/22  USD/Liter
4         China  1.03      1.06    Jul/22  USD/Liter

In [77]:
df.dtypes

Country       object
Last         float64
Previous     float64
Reference     object
Unit          object
dtype: object

In [79]:
df.loc[
    df['Country'] == 'United States',  # row selector -- looking for US row(s)
    'Last'
]

7    1.2
Name: Last, dtype: float64

In [86]:
# in which countries is gasoline more expensive than the United States?

df.loc[df['Last'] > df.loc[
            df['Country'] == 'United States', 
            'Last'
        ].mean(),
       'Country']

8              India
9             Turkey
10         Australia
11             Japan
12            Canada
13       South Korea
14      South Africa
15           Germany
16            France
17             Italy
18         Singapore
19             Spain
20    United Kingdom
21       Switzerland
22       Netherlands
Name: Country, dtype: object

In [87]:
df.loc[df['Last'] > (1.5 * df.loc[
            df['Country'] == 'United States', 
            'Last'
        ].mean()),
       'Country']

15           Germany
16            France
17             Italy
18         Singapore
19             Spain
20    United Kingdom
21       Switzerland
22       Netherlands
Name: Country, dtype: object

In [88]:
df.loc[df['Last'] > (2 * df.loc[
            df['Country'] == 'United States', 
            'Last'
        ].mean()),
       'Country']

Series([], Name: Country, dtype: object)

# Next up:

1. Sorting (by value, and by index)
2. Grouping

In [ ]:
# why might you get an error from read_html?

# because read_html depends on the lxml package, which you can download and install from PyPI:

# pip install lxml   # note: this is not a Python command, but rather something you should write at the command line


all_dfs = pd.read_html('https://tradingeconomics.com/country-list/gasoline-prices')

In [89]:
df

           Country  Last  Previous Reference       Unit
0        Indonesia  0.51      0.52    Jun/22  USD/Liter
1     Saudi Arabia  0.62      0.62    Jul/22  USD/Liter
2           Russia  0.86      0.96    Jul/22  USD/Liter
3        Argentina  0.91      0.95    Jul/22  USD/Liter
4            China  1.03      1.06    Jul/22  USD/Liter
5           Mexico  1.06      1.07    Jul/22  USD/Liter
6           Brazil  1.09      1.41    Jul/22  USD/Liter
7    United States  1.20      1.30    Jul/22  USD/Liter
8            India  1.21      1.23    Jul/22  USD/Liter
9           Turkey  1.25      1.49    Jul/22  USD/Liter
10       Australia  1.26      1.46    Jul/22  USD/Liter
11           Japan  1.28      1.29    Jul/22  USD/Liter
12          Canada  1.42      1.59    Jul/22  USD/Liter
13     South Korea  1.46      1.64    Jul/22  USD/Liter
14    South Africa  1.60      1.48    Jul/22  USD/Liter
15         Germany  1.82      1.99    Jul/22  USD/Liter
16          France  1.98      2.27    Jul/22  USD/Liter
17           Italy  2.04      2.26    Jul/22  USD/Liter
18       Singapore  2.10      2.36    Jul/22  USD/Liter
19           Spain  2.18      2.29    Jul/22  USD/Liter
20  United Kingdom  2.22      2.32    Jul/22  USD/Liter
21     Switzerland  2.24      2.14    May/22  USD/Liter
22     Netherlands  2.29      2.54    Jul/22  USD/Liter

In [92]:
# this returns a series with one element, not a single floating-point value
us_price = df.loc[df['Country'] == 'United States', 'Last']

In [94]:
us_price

7    1.2
Name: Last, dtype: float64

In [95]:
# since you know that there's only 1 value, you can use min, max, mean, etc.
us_price.min()

1.2

In [97]:
df['Last'] > us_price.min()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
20     True
21     True
22     True
Name: Last, dtype: bool

In [100]:
# I want to sort gas prices by country name

df.sort_values(by='Country')   # give me back a new data frame, same as df, but sorted (ascending) by country

           Country  Last  Previous Reference       Unit
3        Argentina  0.91      0.95    Jul/22  USD/Liter
10       Australia  1.26      1.46    Jul/22  USD/Liter
6           Brazil  1.09      1.41    Jul/22  USD/Liter
12          Canada  1.42      1.59    Jul/22  USD/Liter
4            China  1.03      1.06    Jul/22  USD/Liter
16          France  1.98      2.27    Jul/22  USD/Liter
15         Germany  1.82      1.99    Jul/22  USD/Liter
8            India  1.21      1.23    Jul/22  USD/Liter
0        Indonesia  0.51      0.52    Jun/22  USD/Liter
17           Italy  2.04      2.26    Jul/22  USD/Liter
11           Japan  1.28      1.29    Jul/22  USD/Liter
5           Mexico  1.06      1.07    Jul/22  USD/Liter
22     Netherlands  2.29      2.54    Jul/22  USD/Liter
2           Russia  0.86      0.96    Jul/22  USD/Liter
1     Saudi Arabia  0.62      0.62    Jul/22  USD/Liter
18       Singapore  2.10      2.36    Jul/22  USD/Liter
14    South Africa  1.60      1.48    Jul/22  USD/Liter
13     South Korea  1.46      1.64    Jul/22  USD/Liter
19           Spain  2.18      2.29    Jul/22  USD/Liter
21     Switzerland  2.24      2.14    May/22  USD/Liter
9           Turkey  1.25      1.49    Jul/22  USD/Liter
20  United Kingdom  2.22      2.32    Jul/22  USD/Liter
7    United States  1.20      1.30    Jul/22  USD/Liter

# Where/why sort?

1. For more aesthetic presentations
2. Grab the top/bottom n values from our data set
3. Sometimes, you can sort the data in a bunch of different ways -- sort_values lets us choose which way to sort

To sort our data by a column, just name the column in the `by` keyword argument

Like most other methods that we can run on a data frame, `sort_values` does *not* modify anything, but rather returns a new data frame.

In [101]:
# to keep the changes, assign back to df

df = df.sort_values(by='Country')

In [102]:

df.head()

      Country  Last  Previous Reference       Unit
3   Argentina  0.91      0.95    Jul/22  USD/Liter
10  Australia  1.26      1.46    Jul/22  USD/Liter
6      Brazil  1.09      1.41    Jul/22  USD/Liter
12     Canada  1.42      1.59    Jul/22  USD/Liter
4       China  1.03      1.06    Jul/22  USD/Liter

# Sorting by the index

Often, I want to sort values by the index.  This is especially true when the index contains useful information (e.g., country names, usernames, prices).

In [103]:
df = df.set_index('Country')
df

                Last  Previous Reference       Unit
Country
Argentina       0.91      0.95    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Indonesia       0.51      0.52    Jun/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
Netherlands     2.29      2.54    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter

In [106]:
# now if I sort by something else, say 'Previous', the index will be unsorted

df = df.sort_values(by='Previous')  # we get a new data frame back, based on df
df

                Last  Previous Reference       Unit
Country
Indonesia       0.51      0.52    Jun/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Argentina       0.91      0.95    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
Netherlands     2.29      2.54    Jul/22  USD/Liter

In [108]:
# what if the country names are now my index
# and I want to sort by country name again?

# I can use sort_index

df = df.sort_index()
df

                Last  Previous Reference       Unit
Country
Argentina       0.91      0.95    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Indonesia       0.51      0.52    Jun/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
Netherlands     2.29      2.54    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter

In [110]:
# let's sort by previous price again

df.sort_values('Last')

                Last  Previous Reference       Unit
Country
Indonesia       0.51      0.52    Jun/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
Argentina       0.91      0.95    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter
Netherlands     2.29      2.54    Jul/22  USD/Liter

In [111]:
df.sort_values('Reference')

                Last  Previous Reference       Unit
Country
Argentina       0.91      0.95    Jul/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
Netherlands     2.29      2.54    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter
Indonesia       0.51      0.52    Jun/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter

In [113]:
# can I sort first by date (alphabetically, in this case, which is weird!)
# and then, within the dates, sort by Previous?

# use a list, instead of a string, to name a column

# in this case, we're telling Pandas:
# first sort the rows by Reference
# if the Reference value is the same for two rows, then we sort by Previous value

df.sort_values(by=['Reference', 'Previous'])  # Reference in ascending order, then (if needed) Previous

                Last  Previous Reference       Unit
Country
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Argentina       0.91      0.95    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
Netherlands     2.29      2.54    Jul/22  USD/Liter
Indonesia       0.51      0.52    Jun/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter

In [114]:
# can I sort first by date (alphabetically, in this case, which is weird!)
# and then, within the dates, sort by Previous, in descending order?

# use a list, instead of a string, to name a column

# in this case, we're telling Pandas:
# first sort the rows by Reference
# if the Reference value is the same for two rows, then we sort by Previous value DESCENDING

df.sort_values(by='Previous', ascending=False)  # this is how you sort in descending order

                Last  Previous Reference       Unit
Country
Netherlands     2.29      2.54    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
Argentina       0.91      0.95    Jul/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Indonesia       0.51      0.52    Jun/22  USD/Liter

In [115]:
# reference in ascending order
# previous in descending order
df.sort_values(by=['Reference','Previous'], ascending=[True, False])

                Last  Previous Reference       Unit
Country
Netherlands     2.29      2.54    Jul/22  USD/Liter
Singapore       2.10      2.36    Jul/22  USD/Liter
United Kingdom  2.22      2.32    Jul/22  USD/Liter
Spain           2.18      2.29    Jul/22  USD/Liter
France          1.98      2.27    Jul/22  USD/Liter
Italy           2.04      2.26    Jul/22  USD/Liter
Germany         1.82      1.99    Jul/22  USD/Liter
South Korea     1.46      1.64    Jul/22  USD/Liter
Canada          1.42      1.59    Jul/22  USD/Liter
Turkey          1.25      1.49    Jul/22  USD/Liter
South Africa    1.60      1.48    Jul/22  USD/Liter
Australia       1.26      1.46    Jul/22  USD/Liter
Brazil          1.09      1.41    Jul/22  USD/Liter
United States   1.20      1.30    Jul/22  USD/Liter
Japan           1.28      1.29    Jul/22  USD/Liter
India           1.21      1.23    Jul/22  USD/Liter
Mexico          1.06      1.07    Jul/22  USD/Liter
China           1.03      1.06    Jul/22  USD/Liter
Russia          0.86      0.96    Jul/22  USD/Liter
Argentina       0.91      0.95    Jul/22  USD/Liter
Saudi Arabia    0.62      0.62    Jul/22  USD/Liter
Indonesia       0.51      0.52    Jun/22  USD/Liter
Switzerland     2.24      2.14    May/22  USD/Liter

# Exercise: Sorting taxi data

1. Read the taxi data (`taxi.csv` or `nyc_taxi_2019-01.csv`) in, looking at columns `passenger_count`, `trip_distance`, and `total_amount`.
2. What were the 10 longest trips that people took?
3. What were the 10 cheapest trips that people took, where the amount was > 0?
4. Set `trip_distance` to be the index.  Now sort by the index, and find the 10 shortest trips.

In [116]:
!ls taxi.csv

taxi.csv